<?php

return [
    'posts' => [
        'created' => 'Пост создан',
        'updated' => 'Пост обновлен',
        'deleted' => 'Пост удален',
        'not_found' => 'Пост не найден',
        'unauthorized' => 'У вас нет прав доступа к этому посту',
        'forbidden' => 'У вас нет прав доступа к этому посту',
        'retrieved' => 'Посты успешно получены'
    ],
    'auth' => [
        'login' => 'Вход успешно выполнен',
        'register' => 'Регистрация успешно выполнена',
        'logout' => 'Выход успешно выполнен',
        'unauthorized' => 'Вы не вошли в систему',
        'forbidden' => 'У вас нет прав доступа к этому ресурсу',
        'user_not_found' => 'Пользователь не найден',
        'invalid_credentials' => 'Неверный логин или пароль',
    ]
];